money/index.org
#+TITLE: Brendan's Money
* Inputs                                                           :noexport:
** Prices
#+begin_src python :results verbatim raw
  import requests
  import os
  from datetime import date
  url = "https://alpha-vantage.p.rapidapi.com/query"
  stocks = [
    "VTSAX",
    "VTIAX",
    "FSPSX",
    "FXAIX"
  ]

  env_key = "RAPID_API_KEY"
  rapid_api_key = os.getenv(env_key)

  return_string = "#+name: prices\n#+begin_src ledger :eval never\n"
  for stock in stocks:
    querystring = {
      "function":"GLOBAL_QUOTE",
      "symbol":stock,
      "datatype":"csv"
    }
    headers = {
      "X-RapidAPI-Key": rapid_api_key,
      "X-RapidAPI-Host": "alpha-vantage.p.rapidapi.com"
    }
    response = requests.request("GET", url, headers=headers, params=querystring)
    csv_text = response.text.split('\r\n')
    headers = csv_text[0].split(',')
    values = csv_text[1].split(',')

    index = -1
    for i, header in enumerate(headers):
      if header == 'price':
	index = i
    if index != -1:
      return_string = return_string + "  P {} 00:00:00 {} ${}".format(date.today().strftime("%m/%d/%Y"), stock, values[index]) + "\n"
  return_string = return_string + "  P {} 00:00:00 {} ${}".format(date.today().strftime("%m/%d/%Y"), "CONDO", "250,000.00") + "\n"
  return_string = return_string + "  P {} 00:00:00 {} ${}".format(date.today().strftime("%m/%d/%Y"), "COTTA", "400,000.00") + "\n"
  return_string = return_string + "#+end_src"
  return return_string
#+end_src

#+RESULTS:
#+name: prices
#+begin_src ledger :eval never
  P 06/27/2023 00:00:00 VTSAX $104.6200
  P 06/27/2023 00:00:00 VTIAX $29.5700
  P 06/27/2023 00:00:00 FSPSX $45.2600
  P 06/27/2023 00:00:00 FXAIX $151.4300
  P 06/27/2023 00:00:00 CONDO $250,000.00
  P 06/27/2023 00:00:00 COTTA $400,000.00
#+end_src

