money/index.org
** Initial Balance
#+name: opening_balance
#+begin_src ledger :eval never
  2023-04-01 * Initial Balance
      Assets:Checking:Northwoods            $ 9,495.85
      Assets:Checking:RipCo                 $ 3,250.00
      Assets:Savings:Northwoods             $ 5,000.00
      Assets:Savings:RipCo                  $ 1,999.99
      Assets:Savings:UFB                   $ 12,000.93
      Assets:Investments:401K                  354.536 FSPSX
      Assets:Investments:401K                  441.706 FXAIX
      Assets:Investments:HSA                    79.982 FXAIX
      Assets:Investments:IRA                   528.079 VTIAX
      Assets:Investments:IRA                   675.302 VTSAX
      Assets:Investments:RSU                      58.0 STRIP
      Assets:RE:Condo                              1.0 CONDO
      Assets:RE:Cottage                            1.0 COTTA
      Liabilities:RE:Condo:Mortgage      $ -137,137.20
      Liabilities:RE:Cottage:Mortgage    $ -352,049.77
      Equity:OpeningBalance
#+end_src
* Money
** Net Worth
*** Assets
#+begin_src ledger :noweb yes :cmdline bal ^Assets ^Liabilities --cleared :exports results
  <<opening_balance>>
  <<transactions>>
#+end_src
#+results:
#+begin_example
         $ 39,228.13
           1.0 CONDO
           1.0 COTTA
       373.308 FSPSX
       563.335 FXAIX
         802.0 STRIP
       578.148 VTIAX
       723.588 VTSAX  Assets
          $ 2,801.66    Checking
          $ 2,730.66      Northwoods
             $ 71.00      Park City
       373.308 FSPSX
       563.335 FXAIX
         802.0 STRIP
       578.148 VTIAX
       723.588 VTSAX    Investments
       373.308 FSPSX
       476.467 FXAIX      401K
        86.868 FXAIX      HSA
       578.148 VTIAX
       723.588 VTSAX      IRA
         802.0 STRIP      RSU
           1.0 CONDO
           1.0 COTTA    RE
           1.0 CONDO      Condo
           1.0 COTTA      Cottage
         $ 36,426.47    Savings
            $ 426.47      Covantage
         $ 36,000.00      UFB
       $ -434,201.04  Liabilities:RE
        $ -84,000.00    Condo:Mortgage
       $ -350,201.04    Cottage:Mortgage
--------------------
       $ -394,972.91
           1.0 CONDO
           1.0 COTTA
       373.308 FSPSX
       563.335 FXAIX
         802.0 STRIP
       578.148 VTIAX
       723.588 VTSAX
#+end_example
*** Value
#+begin_src ledger :noweb yes :cmdline bal ^Assets ^Liabilities --cleared --market :exports results
  <<prices>>
  <<opening_balance>>
  <<transactions>>
#+end_src
#+RESULTS:
#+begin_example
        $ 900,371.74  Assets
          $ 2,801.66    Checking
          $ 2,730.66      Northwoods
             $ 71.00      Park City
        $ 211,143.61    Investments
         $ 89,047.32      401K
         $ 13,154.42      HSA
         $ 92,797.61      IRA
         $ 16,144.26      RSU
        $ 650,000.00    RE
        $ 250,000.00      Condo
        $ 400,000.00      Cottage
         $ 36,426.47    Savings
            $ 426.47      Covantage
         $ 36,000.00      UFB
       $ -434,201.04  Liabilities:RE
        $ -84,000.00    Condo:Mortgage
       $ -350,201.04    Cottage:Mortgage
--------------------
        $ 466,170.70
#+end_example
** Spending
*** Category Spending
#+begin_src ledger :cmdline reg ^Expenses --monthly --format "%-15(format_date(date, '%B %d %Y'))%-33(account)%(amount)\n" :noweb yes :exports results
  <<opening_balance>>
  <<transactions>>
#+end_src
#+results:
#+begin_example
March 01 2023  Expenses:Taxes:Federal           $ 20,692.80
March 01 2023  Expenses:Taxes:Illinois          $ 4,650.37
March 01 2023  Expenses:Taxes:Medicare          $ 1,362.22
March 01 2023  Expenses:Taxes:Social Security   $ 5,824.69
April 01 2023  Expenses:Food:Fast Food          $ 38.75
April 01 2023  Expenses:Food:Groceries          $ 142.45
April 01 2023  Expenses:Food:Restaurants        $ 28.62
April 01 2023  Expenses:Food:Snacks             $ 56.33
April 01 2023  Expenses:Gifts                   $ 303.19
April 01 2023  Expenses:Housing:Rent            $ 1,328.95
April 01 2023  Expenses:Housing:Utilities       $ 60.33
April 01 2023  Expenses:Personal:Communication  $ 35.00
April 01 2023  Expenses:Personal:Household      $ 242.90
April 01 2023  Expenses:Personal:Learning       $ 120.00
April 01 2023  Expenses:RE:Condo:HOA            $ 132.34
April 01 2023  Expenses:RE:Condo:Interest       $ 428.55
April 01 2023  Expenses:RE:Condo:Repairs        $ 150.48
April 01 2023  Expenses:RE:Cottage:Escrow       $ 882.36
April 01 2023  Expenses:RE:Cottage:Interest     $ 1,026.81
April 01 2023  Expenses:RE:Cottage:Utilities    $ 323.17
April 01 2023  Expenses:Taxes:Federal           $ 4,507.84
April 01 2023  Expenses:Taxes:Illinois          $ 655.51
April 01 2023  Expenses:Taxes:Medicare          $ 192.02
April 01 2023  Expenses:Taxes:Social Security   $ 448.13
April 01 2023  Expenses:Taxes:Tools             $ 297.57
April 01 2023  Expenses:Transportation:Biking   $ 134.43
April 01 2023  Expenses:Transportation:Gas      $ 20.98
May 01 2023    Expenses:Food:Drinks             $ 16.00
May 01 2023    Expenses:Food:Fast Food          $ 205.32
May 01 2023    Expenses:Food:Groceries          $ 25.37
May 01 2023    Expenses:Food:Snacks             $ 272.02
May 01 2023    Expenses:Housing:Rent            $ 1,328.95
May 01 2023    Expenses:Housing:Utilities       $ 318.00
May 01 2023    Expenses:Personal:Boat           $ 150.34
May 01 2023    Expenses:Personal:Communication  $ 35.00
May 01 2023    Expenses:Personal:Electronics    $ 400.00
May 01 2023    Expenses:Personal:Health         $ 499.00
May 01 2023    Expenses:Personal:Household      $ 9.91
May 01 2023    Expenses:RE:Condo:Interest       $ 396.59
May 01 2023    Expenses:RE:Condo:Repairs        $ 47.68
May 01 2023    Expenses:RE:Cottage:Escrow       $ 864.60
May 01 2023    Expenses:RE:Cottage:Interest     $ 1,025.02
May 01 2023    Expenses:RE:Cottage:Repairs      $ 1,554.93
May 01 2023    Expenses:RE:Cottage:Utilities    $ 245.99
May 01 2023    Expenses:Taxes:Federal           $ 7,280.68
May 01 2023    Expenses:Taxes:Illinois          $ 1,724.45
May 01 2023    Expenses:Taxes:Medicare          $ 538.38
May 01 2023    Expenses:Taxes:Social Security   $ 52.17
May 01 2023    Expenses:Transportation:Biking   $ 34.22
May 01 2023    Expenses:Transportation:Gas      $ 723.65
May 01 2023    Expenses:Transportation:Insurance$ 438.47
June 01 2023   Expenses:Food:Drinks             $ 213.10
June 01 2023   Expenses:Food:Fast Food          $ 235.28
June 01 2023   Expenses:Food:Groceries          $ 467.77
June 01 2023   Expenses:Food:Snacks             $ 117.21
June 01 2023   Expenses:Foods:Snacks            $ 12.88
June 01 2023   Expenses:Gifts                   $ 575.68
June 01 2023   Expenses:Housing:Rent            $ 2,852.14
June 01 2023   Expenses:Housing:Utilities       $ 235.00
June 01 2023   Expenses:Personal:Clothes        $ 108.47
June 01 2023   Expenses:Personal:Communication  $ 144.01
June 01 2023   Expenses:Personal:Electronics    $ 25.00
June 01 2023   Expenses:Personal:Health         $ 45.63
June 01 2023   Expenses:Personal:Household      $ 37.62
June 01 2023   Expenses:Personal:Hygeine        $ 34.73
June 01 2023   Expenses:Personal:Learning       $ 117.43
June 01 2023   Expenses:RE:Condo:Interest       $ 395.77
June 01 2023   Expenses:RE:Condo:Repairs        $ 71.66
June 01 2023   Expenses:RE:Cottage:Cleaning     $ 224.87
June 01 2023   Expenses:RE:Cottage:Escrow       $ 864.60
June 01 2023   Expenses:RE:Cottage:Interest     $ 1,023.22
June 01 2023   Expenses:RE:Cottage:Lakefront    $ 378.00
June 01 2023   Expenses:RE:Cottage:Lawncare     $ 100.00
June 01 2023   Expenses:RE:Cottage:Utilities    $ 245.99
June 01 2023   Expenses:Taxes:Federal           $ 2,261.39
June 01 2023   Expenses:Taxes:Illinois          $ 665.55
June 01 2023   Expenses:Taxes:Medicare          $ 308.38
June 01 2023   Expenses:Taxes:Social Security   $ 52.22
June 01 2023   Expenses:Transportation:Biking   $ 70.96
June 01 2023   Expenses:Transportation:Gas      $ 65.02
June 01 2023   Expenses:Transportation:Repairs  $ 751.78
June 01 2023   Expenses:Transportation:Ride Share$ 17.61
July 01 2023   Expenses:RE:Condo:Interest       $ 275.00
#+end_example
