money/index.org
*** Monthly Spending
#+begin_src ledger :cmdline reg ^Expenses and not Taxes -MnA --sort date --format "%-15(format_date(date, '%B %Y')) %(amount)\n" :noweb yes :exports results
  <<opening_balance>>
  <<transactions>>
#+end_src
#+results:
: April 2023      $ 5,455.64
: May 2023        $ 8,591.06
: June 2023       $ 9,431.43
: July 2023       $ 275.00
