money/index.org
*** Transactions
#+begin_src ledger :cmdline reg ^Expenses ^Income --sort -date --format "%-15(format_date(date, '%B %d %Y'))%-33(payee)%-33(account)%(amount)\n" :noweb yes :exports results
  <<opening_balance>>
  <<transactions>>
#+end_src
#+results:
#+begin_example
July 01 2023   Huntington                       Expenses:RE:Condo:Interest       $ 275.00
June 26 2023   Xfinity                          Expenses:Housing:Utilities       $ 70.00
June 26 2023   Divvy Bikes                      Expenses:Transportation:Biking   $ 1.30
June 26 2023   VRBO                             Income:RE:Cottage:Rent           $ -1,379.49
June 25 2023   Walgreens                        Expenses:Food:Snacks             $ 1.31
June 25 2023   Athletic Greens                  Expenses:Food:Groceries          $ 88.00
June 25 2023   McDonald's                       Expenses:Food:Fast Food          $ 7.83
June 25 2023   Kass Property Management         Expenses:Housing:Rent            $ 1,442.69
June 25 2023   PayRange                         Expenses:Personal:Household      $ 25.00
June 25 2023   Barnes & Noble                   Expenses:Personal:Learning       $ 72.09
June 24 2023   McDonald's                       Expenses:Food:Fast Food          $ 4.20
June 24 2023   BP                               Expenses:Food:Snacks             $ 8.24
June 24 2023   BP                               Expenses:Transportation:Gas      $ 30.00
June 24 2023   Target                           Expenses:Personal:Clothes        $ 27.77
June 24 2023   Walgreens                        Expenses:Food:Snacks             $ 1.31
June 24 2023   Chick-fil-a                      Expenses:Food:Fast Food          $ 9.90
June 24 2023   Target                           Expenses:Personal:Hygeine        $ 34.73
June 24 2023   McDonald's                       Expenses:Food:Fast Food          $ 6.18
June 24 2023   Walgreens                        Expenses:Food:Snacks             $ 5.84
June 24 2023   Brooke Janicki                   Expenses:RE:Cottage:Cleaning     $ 84.87
June 24 2023   Ricky                            Expenses:RE:Cottage:Lawncare     $ 50.00
June 24 2023   Dan's Docks                      Expenses:RE:Cottage:Lakefront    $ 378.00
June 24 2023   Patagonia                        Expenses:Personal:Clothes        $ 80.70
June 24 2023   State Street Barber              Expenses:Personal:Health         $ 45.00
June 23 2023   Stripe                           Income:Stripe:Paycheck           $ -6,333.77
June 23 2023   Stripe                           Expenses:Taxes:Federal           $ 1,138.41
June 23 2023   Stripe                           Expenses:Taxes:Medicare          $ 148.84
June 23 2023   Stripe                           Expenses:Taxes:Illinois          $ 313.52
June 23 2023   Peoples Gas                      Expenses:Housing:Utilities       $ 94.00
June 23 2023   SWAQ                             Income:SWAQ:Paycheck             $ -436.68
June 23 2023   SWAQ                             Expenses:Taxes:Medicare          $ 6.33
June 23 2023   SWAQ                             Expenses:Taxes:Social Security   $ 27.08
June 23 2023   SWAQ                             Expenses:Taxes:Illinois          $ 21.62
June 23 2023   Divvy Bikes                      Expenses:Transportation:Biking   $ 1.11
June 23 2023   Lincoln Park Auto                Expenses:Transportation:Repairs  $ 751.78
June 23 2023   7/11                             Expenses:Food:Snacks             $ 8.08
June 23 2023   Walgreens                        Expenses:Food:Snacks             $ 1.31
June 23 2023   Target                           Expenses:Food:Snacks             $ 2.73
June 23 2023   Walgreens                        Expenses:Food:Snacks             $ 1.97
June 23 2023   Taco Bell                        Expenses:Food:Fast Food          $ 12.48
June 22 2023   Walgreens                        Expenses:Food:Snacks             $ 3.95
June 22 2023   7/11                             Expenses:Food:Snacks             $ 5.04
June 22 2023   7/11                             Expenses:Food:Snacks             $ 9.25
June 22 2023   Noodles & Company                Expenses:Food:Fast Food          $ 3.63
June 22 2023   Noodles & Company                Expenses:Food:Fast Food          $ 3.63
June 22 2023   7/11                             Expenses:Food:Snacks             $ 5.35
June 22 2023   7/11                             Expenses:Food:Snacks             $ 12.65
June 22 2023   Panera Bread                     Expenses:Food:Fast Food          $ 3.71
June 22 2023   Chick-fil-a                      Expenses:Food:Fast Food          $ 8.84
June 22 2023   Taco Bell                        Expenses:Food:Fast Food          $ 10.37
June 22 2023   7/11                             Expenses:Food:Snacks             $ 10.09
June 22 2023   Divvy Bikes                      Expenses:Transportation:Biking   $ 6.50
June 21 2023   McDonald's                       Expenses:Food:Fast Food          $ 6.24
June 21 2023   7/11                             Expenses:Food:Snacks             $ 10.29
June 19 2023   Divvy Bikes                      Expenses:Transportation:Biking   $ 3.52
June 19 2023   Divvy Bikes                      Expenses:Transportation:Biking   $ 6.20
June 19 2023   Divvy Bikes                      Expenses:Transportation:Biking   $ 8.52
June 18 2023   Kwik Trip                        Expenses:Transportation:Gas      $ 35.02
June 18 2023   Kwik Trip                        Expenses:Food:Drinks             $ 33.22
June 18 2023   Jewel                            Expenses:Food:Groceries          $ 28.69
June 18 2023   Wrigley Field                    Expenses:Food:Drinks             $ 29.88
June 18 2023   Chick-Fil-A                      Expenses:Food:Fast Food          $ 8.21
June 18 2023   Goodman Theatre                  Expenses:Gifts                   $ 240.00
June 18 2023   Target                           Expenses:Food:Groceries          $ 18.89
June 18 2023   Home Depot                       Expenses:Personal:Household      $ 12.62
June 18 2023   Subway                           Expenses:Food:Fast Food          $ 1.75
June 18 2023   McDonalds                        Expenses:Food:Fast Food          $ 6.18
June 18 2023   Noodles & Company                Expenses:Food:Fast Food          $ 3.63
June 18 2023   7/11                             Expenses:Food:Snacks             $ 6.25
June 18 2023   Taco Bell                        Expenses:Food:Fast Food          $ 17.53
June 18 2023   GoDaddy                          Expenses:Personal:Communication  $ 109.01
June 17 2023   Buffalo Wild Wings               Expenses:Food:Fast Food          $ 25.00
June 17 2023   7/11                             Expenses:Food:Snacks             $ 8.24
June 17 2023   Barnes & Noble                   Expenses:Personal:Learning       $ 34.32
June 16 2023   Taco Bell                        Expenses:Food:Fast Food          $ 25.00
June 16 2023   Divvy Bikes                      Expenses:Transportation:Biking   $ 1.18
June 16 2023   Interest                         Income:Extra                     $ -0.09
June 14 2023   VRBO                             Income:RE:Cottage:Rent           $ -1,196.26
June 13 2023   Spectrum                         Expenses:RE:Cottage:Utilities    $ 69.99
June 13 2023   Home Depot                       Expenses:RE:Condo:Repairs        $ 11.91
June 13 2023   Home Depot                       Expenses:RE:Condo:Repairs        $ 6.03
June 13 2023   Home Depot                       Expenses:Gifts                   $ 335.68
June 13 2023   Divvy Bikes                      Expenses:Transportation:Biking   $ 3.15
June 13 2023   7/11                             Expenses:Foods:Snacks            $ 2.72
June 13 2023   7/11                             Expenses:Foods:Snacks            $ 10.16
June 13 2023   Sure-Dry                         Income:Extra                     $ -2,263.93
June 12 2023   Mariano's                        Expenses:Food:Groceries          $ 168.75
June 12 2023   Mariano's                        Expenses:Food:Groceries          $ 19.26
June 12 2023   Dollar Tree                      Expenses:Food:Snacks             $ 5.51
June 12 2023   McDonalds                        Expenses:Food:Fast Food          $ 6.63
June 12 2023   McDonalds                        Expenses:Food:Fast Food          $ 3.87
June 12 2023   Dunkin Donuts                    Expenses:Food:Fast Food          $ 1.65
June 12 2023   Lyft                             Expenses:Transportation:Ride Share$ 17.61
June 12 2023   Culver's                         Expenses:Food:Fast Food          $ 13.00
June 12 2023   Divvy Bikes                      Expenses:Transportation:Biking   $ 1.67
June 11 2023   Over/Under                       Expenses:Food:Drinks             $ 150.00
June 11 2023   Divvy Bikes                      Expenses:Transportation:Biking   $ 1.18
June 11 2023   Divvy Bikes                      Expenses:Transportation:Biking   $ 3.24
June 11 2023   Target                           Expenses:Food:Groceries          $ 31.58
June 11 2023   Home Depot                       Expenses:RE:Condo:Repairs        $ 11.64
June 11 2023   Home Depot                       Expenses:RE:Condo:Repairs        $ 42.08
June 11 2023   Chick Fil A                      Expenses:Food:Fast Food          $ 8.84
June 10 2023   TimeCave                         Expenses:Personal:Electronics    $ 25.00
June 09 2023   Stripe                           Income:Stripe:Paycheck           $ -6,333.77
June 09 2023   Stripe                           Income:Stripe:Wireless           $ -50.00
June 09 2023   Stripe                           Income:Stripe:Wellness           $ -164.78
June 09 2023   Stripe                           Expenses:Taxes:Federal           $ 1,122.98
June 09 2023   Stripe                           Expenses:Taxes:Medicare          $ 147.33
June 09 2023   Stripe                           Expenses:Taxes:Illinois          $ 310.34
June 09 2023   Stripe                           Income:Stripe:HSA                $ -100.00
June 09 2023   SWAQ                             Expenses:Taxes:Illinois          $ 20.07
June 09 2023   SWAQ                             Expenses:Taxes:Medicare          $ 5.88
June 09 2023   SWAQ                             Expenses:Taxes:Social Security   $ 25.14
June 09 2023   SWAQ                             Income:SWAQ:Paycheck             $ -405.54
June 09 2023   Brooke Janicki                   Expenses:RE:Cottage:Cleaning     $ 140.00
June 09 2023   Divvy Bikes                      Expenses:Transportation:Biking   $ 4.39
June 08 2023   7/11                             Expenses:Food:Snacks             $ 4.42
June 08 2023   Divvy Bikes                      Expenses:Transportation:Biking   $ 3.26
June 08 2023   Panera Bread                     Expenses:Food:Fast Food          $ 21.80
June 07 2023   Divvy Bikes                      Expenses:Transportation:Biking   $ 4.26
June 07 2023   7/11                             Expenses:Food:Snacks             $ 5.38
June 07 2023   Divvy Bikes                      Expenses:Transportation:Biking   $ 3.05
June 06 2023   Divvy Bikes                      Expenses:Transportation:Biking   $ 12.34
June 06 2023   Barnes & Noble                   Expenses:Personal:Learning       $ 11.02
June 06 2023   USPS                             Expenses:Personal:Health         $ 0.63
June 06 2023   Divvy Bikes                      Expenses:Transportation:Biking   $ 1.67
June 05 2023   Mariano's                        Expenses:Food:Groceries          $ 73.70
June 05 2023   Comed                            Expenses:Housing:Utilities       $ 71.00
June 05 2023   Ricky                            Expenses:RE:Cottage:Lawncare     $ 50.00
June 05 2023   Wisconsin Public Service         Expenses:RE:Cottage:Utilities    $ 176.00
June 05 2023   Interest                         Income:Extra                     $ -0.45
June 05 2023   Target                           Expenses:Food:Groceries          $ 38.90
June 04 2023   Panera Bread                     Expenses:Food:Fast Food          $ 3.71
June 04 2023   Divvy Bikes                      Expenses:Transportation:Biking   $ 4.42
June 04 2023   Panera Bread                     Expenses:Food:Fast Food          $ 3.71
June 04 2023   Jeni's                           Expenses:Food:Fast Food          $ 7.76
June 01 2023   Huntington                       Expenses:RE:Condo:Interest       $ 395.77
June 01 2023   Rent                             Income:RE:Condo:Rent             $ -1,117.66
June 01 2023   Interest                         Income:Extra                     $ -86.54
June 01 2023   Kass Property Management         Expenses:Housing:Rent            $ 1,409.45
June 01 2023   Chase                            Expenses:RE:Cottage:Interest     $ 1,023.22
June 01 2023   Chase                            Expenses:RE:Cottage:Escrow       $ 864.60
June 01 2023   Visible                          Expenses:Personal:Communication  $ 35.00
June 01 2023   Interest                         Income:Extra                     $ -0.04
June 01 2023   Interest                         Income:Extra                     $ -0.76
May 30 2023    Rent                             Income:RE:Condo:Rent             $ -117.66
May 30 2023    Shell                            Expenses:Transportation:Gas      $ 371.03
May 26 2023    SWAQ                             Income:SWAQ:Paycheck             $ -273.06
May 26 2023    SWAQ                             Expenses:Taxes:Medicare          $ 3.96
May 26 2023    SWAQ                             Expenses:Taxes:Social Security   $ 16.93
May 26 2023    SWAQ                             Expenses:Taxes:Illinois          $ 13.52
May 26 2023    Stripe                           Income:Stripe:Paycheck           $ -6,333.78
May 26 2023    Stripe                           Expenses:Taxes:Federal           $ 1,138.41
May 26 2023    Stripe                           Expenses:Taxes:Medicare          $ 105.74
May 26 2023    Stripe                           Expenses:Taxes:Illinois          $ 313.52
May 26 2023    Income                           Income:Extra                     $ -25.00
May 26 2023    Adam Marvin                      Expenses:RE:Cottage:Repairs      $ 1,517.00
May 25 2023    Dividend                         Income:Extra                     $ -0.10
May 25 2023    Xfinity                          Expenses:Housing:Utilities       $ 70.00
May 25 2023    Panera Bread                     Expenses:Food:Fast Food          $ 25.00
May 25 2023    Divvy Bikes                      Expenses:Transportation:Biking   $ 3.83
May 24 2023    7/11                             Expenses:Food:Snacks             $ 3.92
May 24 2023    Divvy Bikes                      Expenses:Transportation:Biking   $ 0.88
May 23 2023    Walgreens                        Expenses:Transportation:Gas      $ 107.13
May 23 2023    Milito's                         Expenses:Transportation:Gas      $ 44.84
May 23 2023    Shell                            Expenses:Transportation:Gas      $ 33.79
May 23 2023    Shell                            Expenses:Food:Snacks             $ 8.01
May 23 2023    Jewel Osco                       Expenses:Food:Groceries          $ 25.37
May 23 2023    Taco Bell                        Expenses:Food:Fast Food          $ 12.15
May 22 2023    Dollar General                   Expenses:Food:Snacks             $ 6.00
May 22 2023    Culver's                         Expenses:Food:Fast Food          $ 11.49
May 22 2023    Corcoran's                       Expenses:Food:Drinks             $ 16.00
May 21 2023    Krist Oil                        Expenses:Transportation:Gas      $ 92.85
May 21 2023    Geico                            Expenses:Transportation:Insurance$ 438.47
May 20 2023    XSport                           Expenses:Personal:Health         $ 499.00
May 19 2023    Mom                              Expenses:Transportation:Gas      $ -105.09
May 19 2023    Gas                              Expenses:Transportation:Gas      $ 26.71
May 19 2023    Dollar General                   Expenses:Food:Snacks             $ 10.39
May 18 2023    7/11                             Expenses:Food:Snacks             $ 5.38
May 18 2023    7/11                             Expenses:Food:Snacks             $ 5.17
May 18 2023    Divvy Bikes                      Expenses:Transportation:Biking   $ 12.09
May 18 2023    Adams Mobile Marine              Expenses:Personal:Boat           $ 150.34
May 18 2023    Kwik Trip                        Expenses:Food:Snacks             $ 7.71
May 18 2023    Culver's                         Expenses:Food:Fast Food          $ 10.96
May 18 2023    BP                               Expenses:Food:Snacks             $ 5.94
May 18 2023    Popeye's                         Expenses:Food:Fast Food          $ 6.12
May 18 2023    Panera Bread                     Expenses:Food:Fast Food          $ 3.65
May 18 2023    7/11                             Expenses:Food:Snacks             $ 32.01
May 17 2023    7/11                             Expenses:Food:Snacks             $ 6.08
May 17 2023    Buona Beef                       Expenses:Food:Fast Food          $ 5.49
May 17 2023    Auntie Anne's                    Expenses:Food:Fast Food          $ 8.71
May 17 2023    Panera Bread                     Expenses:Food:Fast Food          $ 3.65
May 17 2023    Walgreens                        Expenses:Food:Snacks             $ 3.56
May 15 2023    7/11                             Expenses:Food:Snacks             $ 5.64
May 15 2023    Road Ranger                      Expenses:Transportation:Gas      $ 12.01
May 15 2023    Subway                           Expenses:Food:Fast Food          $ 1.10
May 15 2023    Phillips 66                      Expenses:Food:Snacks             $ 2.43
May 15 2023    Phillips 66                      Expenses:Transportation:Gas      $ 39.17
May 15 2023    DQ                               Expenses:Food:Fast Food          $ 4.43
May 15 2023    Divvy Bikes                      Expenses:Transportation:Biking   $ 2.78
May 15 2023    Cash Back                        Income:Extra                     $ -10.00
May 15 2023    Peoples Gas                      Expenses:Housing:Utilities       $ 188.00
May 15 2023    Spectrum                         Expenses:RE:Cottage:Utilities    $ 69.99
May 15 2023    Stripe                           Income:Stripe:RSU                $ -22,565.73
May 15 2023    Stripe                           Expenses:Taxes:Federal           $ 4,977.27
May 15 2023    Stripe                           Expenses:Taxes:Medicare          $ 327.20
May 15 2023    Stripe                           Expenses:Taxes:Illinois          $ 1,117.00
May 14 2023    7/11                             Expenses:Food:Snacks             $ 5.96
May 13 2023    iPhone                           Expenses:Personal:Electronics    $ 400.00
May 13 2023    7/11                             Expenses:Food:Snacks             $ 2.01
May 13 2023    Armitage Mayfest                 Expenses:Food:Fast Food          $ 14.69
May 13 2023    7/11                             Expenses:Food:Snacks             $ 5.96
May 13 2023    Target                           Expenses:Food:Snacks             $ 4.83
May 13 2023    Krispy Krunchy                   Expenses:Food:Fast Food          $ 9.79
May 12 2023    SWAQ                             Income:SWAQ:Paycheck             $ -568.44
May 12 2023    SWAQ                             Expenses:Taxes:Medicare          $ 8.25
May 12 2023    SWAQ                             Expenses:Taxes:Social Security   $ 35.24
May 12 2023    SWAQ                             Expenses:Taxes:Illinois          $ 28.14
May 12 2023    SWAQ                             Expenses:Taxes:Federal           $ 3.57
May 12 2023    7/11                             Expenses:Food:Snacks             $ 92.83
May 12 2023    Stripe                           Income:Stripe:Paycheck           $ -6,333.77
May 12 2023    Stripe                           Income:Stripe:Wireless           $ -50.00
May 12 2023    Stripe                           Income:Stripe:Wellness           $ -156.01
May 12 2023    Stripe                           Expenses:Taxes:Federal           $ 1,161.43
May 12 2023    Stripe                           Expenses:Taxes:Medicare          $ 93.23
May 12 2023    Stripe                           Expenses:Taxes:Illinois          $ 318.27
May 12 2023    Stripe                           Income:Stripe:HSA                $ -100.00
May 12 2023    Amazon                           Expenses:Personal:Household      $ -37.47
May 11 2023    Shell                            Expenses:Food:Fast Food          $ 10.94
May 11 2023    Krist Oil                        Expenses:Transportation:Gas      $ 31.37
May 11 2023    Krist Oil                        Expenses:Food:Snacks             $ 5.15
May 11 2023    7/11                             Expenses:Food:Snacks             $ 5.96
May 11 2023    Chick-Fil-A                      Expenses:Food:Fast Food          $ 8.84
May 11 2023    Shell                            Expenses:Transportation:Gas      $ 34.43
May 09 2023    Wisconsin Public Service         Expenses:RE:Cottage:Utilities    $ 176.00
May 08 2023    Lotters                          Expenses:Food:Snacks             $ 21.71
May 08 2023    Kwik Trip                        Expenses:Transportation:Gas      $ 35.41
May 08 2023    Conway True Value                Expenses:RE:Cottage:Repairs      $ 37.93
May 08 2023    Kwik Trip                        Expenses:Food:Snacks             $ 11.66
May 08 2023    Amazon                           Expenses:Personal:Household      $ 47.38
May 07 2023    Chick-Fil-A                      Expenses:Food:Fast Food          $ 8.84
May 07 2023    7/11                             Expenses:Food:Snacks             $ 1.51
May 07 2023    7/11                             Expenses:Food:Snacks             $ 3.30
May 07 2023    Divvy Bikes                      Expenses:Transportation:Biking   $ 1.11
May 07 2023    Divvy Bikes                      Expenses:Transportation:Biking   $ 0.88
May 07 2023    Home Depot                       Expenses:RE:Condo:Repairs        $ 9.13
May 07 2023    Home Depot                       Expenses:RE:Condo:Repairs        $ 38.55
May 05 2023    State of Illinois                Expenses:Taxes:Illinois          $ -66.00
May 05 2023    Divvy Bikes                      Expenses:Transportation:Biking   $ 1.30
May 04 2023    Molly's Cupcake                  Expenses:Food:Snacks             $ 8.90
May 03 2023    Yardi Penny Test                 Income:Extra                     $ -0.49
May 03 2023    Comed                            Expenses:Housing:Utilities       $ 60.00
May 03 2023    Kass Property Management         Expenses:Housing:Rent            $ 1,328.95
May 03 2023    Divvy Bikes                      Expenses:Transportation:Biking   $ 3.15
May 02 2023    Divvy Bikes                      Expenses:Transportation:Biking   $ 8.20
May 01 2023    Rent                             Income:RE:Condo:Rent             $ -900.00
May 01 2023    Huntington                       Expenses:RE:Condo:Interest       $ 396.59
May 01 2023    Visible                          Expenses:Personal:Communication  $ 35.00
May 01 2023    Chase                            Expenses:RE:Cottage:Interest     $ 1,025.02
May 01 2023    Chase                            Expenses:RE:Cottage:Escrow       $ 864.60
May 01 2023    Doordash                         Expenses:Food:Fast Food          $ 7.70
May 01 2023    Doordash                         Expenses:Food:Fast Food          $ 40.16
May 01 2023    Doordash                         Expenses:Food:Fast Food          $ 11.61
April 30 2023  Divvy Bikes                      Expenses:Transportation:Biking   $ 1.79
April 30 2023  UFB Direct                       Income:Extra                     $ -15.38
April 28 2023  Interest                         Income:Extra                     $ -0.81
April 28 2023  Stripe                           Income:Stripe:Paycheck           $ -6,333.77
April 28 2023  Stripe                           Expenses:Taxes:Federal           $ 1,138.41
April 28 2023  Stripe                           Expenses:Taxes:Social Security   $ 19.77
April 28 2023  Stripe                           Expenses:Taxes:Medicare          $ 91.84
April 28 2023  Stripe                           Expenses:Taxes:Illinois          $ 313.52
April 28 2023  SWAQ                             Income:SWAQ:Paycheck             $ -343.98
April 28 2023  SWAQ                             Expenses:Taxes:Medicare          $ 4.98
April 28 2023  SWAQ                             Expenses:Taxes:Social Security   $ 21.33
April 28 2023  SWAQ                             Expenses:Taxes:Illinois          $ 17.03
April 28 2023  Divvy Bikes                      Expenses:Transportation:Biking   $ 0.56
April 28 2023  Divvy Bikes                      Expenses:Transportation:Biking   $ 1.11
April 26 2023  Xfinity                          Expenses:Housing:Utilities       $ 60.33
April 25 2023  Divvy Bikes                      Expenses:Transportation:Biking   $ 4.86
April 25 2023  Home Depot                       Expenses:RE:Condo:Repairs        $ 11.85
April 25 2023  Home Depot                       Expenses:RE:Condo:Repairs        $ 25.32
April 25 2023  Citgo                            Expenses:Transportation:Gas      $ 20.98
April 24 2023  Home Depot                       Expenses:RE:Condo:Repairs        $ 16.79
April 24 2023  Divvy Bikes                      Expenses:Transportation:Biking   $ 2.06
April 24 2023  McDonalds                        Expenses:Food:Fast Food          $ 5.63
April 24 2023  7/11                             Expenses:Food:Snacks             $ 6.25
April 24 2023  Panera Bread                     Expenses:Food:Fast Food          $ 3.65
April 24 2023  Dollar Tree                      Expenses:Food:Snacks             $ 11.03
April 23 2023  Dollar Tree                      Expenses:Personal:Household      $ 9.65
April 23 2023  Panera Bread                     Expenses:Food:Fast Food          $ 3.65
April 23 2023  Stratechery                      Expenses:Personal:Learning       $ 120.00
April 23 2023  PayRange                         Expenses:Personal:Household      $ 25.00
April 23 2023  Divvy Bikes                      Expenses:Transportation:Biking   $ 1.18
April 23 2023  Divvy Bikes                      Expenses:Transportation:Biking   $ 3.53
April 23 2023  7/11                             Expenses:Food:Snacks             $ 3.54
April 23 2023  Walgreens                        Expenses:Food:Snacks             $ 1.31
April 23 2023  Cash                             Expenses:Personal:Household      $ 183.25
April 23 2023  Aldi                             Expenses:Food:Groceries          $ 23.32
April 23 2023  Home Depot                       Expenses:RE:Condo:Repairs        $ 96.52
April 21 2023  Crandon Water & Sewer            Expenses:RE:Cottage:Utilities    $ 91.18
April 19 2023  Federal Income Taxes             Expenses:Taxes:Federal           $ 2,208.00
April 19 2023  Broken Barrel                    Expenses:Food:Restaurants        $ 9.04
April 19 2023  Broken Barrel                    Expenses:Food:Restaurants        $ 19.58
April 19 2023  Jewel                            Expenses:Food:Groceries          $ 34.28
April 19 2023  Taco Bell                        Expenses:Food:Fast Food          $ 2.45
April 19 2023  Away Luggage                     Expenses:Gifts                   $ 303.19
April 19 2023  Lyft                             Expenses:Transportation:Biking   $ 0.34
April 18 2023  TurboTax                         Expenses:Taxes:Tools             $ 297.57
April 18 2023  DoorDash                         Expenses:Food:Fast Food          $ 14.99
April 14 2023  Stripe                           Income:Stripe:Paycheck           $ -6,333.77
April 14 2023  Stripe                           Income:Stripe:Wireless           $ -50.00
April 14 2023  Stripe                           Income:Stripe:Wellness           $ -51.02
April 14 2023  Stripe                           Expenses:Taxes:Federal           $ 1,161.43
April 14 2023  Stripe                           Expenses:Taxes:Social Security   $ 398.65
April 14 2023  Stripe                           Expenses:Taxes:Medicare          $ 93.24
April 14 2023  Stripe                           Expenses:Taxes:Illinois          $ 318.27
April 14 2023  Stripe                           Income:Stripe:HSA                $ -100.00
April 14 2023  SWAQ                             Income:SWAQ:Paycheck             $ -135.18
April 14 2023  SWAQ                             Expenses:Taxes:Medicare          $ 1.96
April 14 2023  SWAQ                             Expenses:Taxes:Social Security   $ 8.38
April 14 2023  SWAQ                             Expenses:Taxes:Illinois          $ 6.69
April 14 2023  Cash Back                        Income:Extra                     $ -10.00
April 13 2023  Spectrum                         Expenses:RE:Cottage:Utilities    $ 69.99
April 13 2023  Wisconsin Public Service         Expenses:RE:Cottage:Utilities    $ 162.00
April 11 2023  7/11                             Expenses:Food:Snacks             $ 4.20
April 10 2023  Noodles & Company                Expenses:Food:Fast Food          $ 8.38
April 09 2023  7/11                             Expenses:Food:Snacks             $ 30.00
April 06 2023  Divvy Bikes                      Expenses:Transportation:Biking   $ 119.00
April 05 2023  Dividend                         Income:Extra                     -1.977 FXAIX
April 03 2023  PayRange                         Expenses:Personal:Household      $ 25.00
April 02 2023  Visible                          Expenses:Personal:Communication  $ 35.00
April 02 2023  Target                           Expenses:Food:Groceries          $ 67.17
April 02 2023  Mariano's                        Expenses:Food:Groceries          $ 6.37
April 02 2023  Jewel                            Expenses:Food:Groceries          $ 11.31
April 01 2023  Kass Property Management         Expenses:Housing:Rent            $ 1,328.95
April 01 2023  Huntington                       Expenses:RE:Condo:Interest       $ 428.55
April 01 2023  Chase                            Expenses:RE:Cottage:Interest     $ 1,026.81
April 01 2023  Chase                            Expenses:RE:Cottage:Escrow       $ 882.36
April 01 2023  2672 N Halsted HOA               Expenses:RE:Condo:HOA            $ 132.34
April 01 2023  Zenlord Pro                      Income:RE:Condo:Rent             $ -1,250.00
March 31 2023  Stripe                           Income:Stripe:RSU                $ -93,946.71
March 31 2023  Stripe                           Expenses:Taxes:Federal           $ 20,692.80
March 31 2023  Stripe                           Expenses:Taxes:Social Security   $ 5,824.69
March 31 2023  Stripe                           Expenses:Taxes:Medicare          $ 1,362.22
March 31 2023  Stripe                           Expenses:Taxes:Illinois          $ 4,650.37
#+end_example
